Airfoil_DynamicStall/steady/train/aoa-16/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

convertToMeters 1;

MeshCross 10;
MeshInout 14;
MeshBend 8;

ratio1 0.1;
ratio2 10.0;

vertices  
(
    ( 0 0.0195 0)
    ( 0 0.0945 0)
    ( 0 0.0195 0.075)
    ( 0 0.0945 0.075)
    
    ( 0.75 0.0195 0)
    ( 0.75 0.0945 0)
    ( 0.75 0.0195 0.075)
    ( 0.75 0.0945 0.075)

    ( 0 -0.0195 0)
    ( 0 -0.0945 0)
    ( 0 -0.0195 0.075)
    ( 0 -0.0945 0.075)

    ( 0.75 -0.0195 0)
    ( 0.75 -0.0945 0)
    ( 0.75 -0.0195 0.075)
    ( 0.75 -0.0945 0.075)
    
    ( 0.7695 0 0)
    ( 0.7695 0 0.075)
    ( 0.8445 0 0)
    ( 0.8445 0 0.075)

);

edges  
(
    arc  4 16  ( 0.76378858223313767673 0.01378858223313767673 0)
    arc  6 17  ( 0.76378858223313767673 0.01378858223313767673 0.075)

    arc 12 16  ( 0.76378858223313767673 -0.01378858223313767673 0)
    arc 14 17  ( 0.76378858223313767673 -0.01378858223313767673 0.075)

    arc  5 18  ( 0.81682159082212874106 0.06682159082212874106 0)
    arc  7 19  ( 0.81682159082212874106 0.06682159082212874106 0.075)

    arc 13 18   ( 0.81682159082212874106 -0.06682159082212874106 0)
    arc 15 19  ( 0.81682159082212874106 -0.06682159082212874106 0.075)
);

blocks  
(

    hex (0 4 5 1 2 6 7 3) ($MeshInout $MeshCross $MeshCross) 
    simpleGrading 
    (
        0.04
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
    )

    hex (4 16 18 5 6 17 19 7) ($MeshBend $MeshCross $MeshCross) 
    simpleGrading 
    (
        1.0
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
    )

    hex (13 18 16 12 15 19 17 14) ($MeshBend $MeshCross $MeshCross) 
    simpleGrading 
    (
        1.0
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
    )
    hex (9 13 12 8 11 15 14 10) ($MeshInout $MeshCross $MeshCross) 
    simpleGrading 
    (
        0.04
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
        (
            (0.5 0.5 $ratio2)
            (0.5 0.5 $ratio1)
        )
    )

);


patches  
( 

  patch inlet
  (
      (0 1 3 2)
  ) 
  patch outlet
  (
      (9 8 10 11)
  )
  wall ubend
  (     
      (0 4 5 1)
      (0 4 6 2)
      (1 5 7 3)
      (2 3 7 6)
      (4 16 18 5)
      (4 16 17 6)
      (6 17 19 7)
      (5 18 19 7)
      (13 18 16 12)
      (13 15 19 18)
      (12 16 17 14)
      (14 17 19 15)
      (9 13 12 8)
      (9 11 15 13)
      (8 12 14 10)
      (11 15 14 10)

  )
);

mergePatchPairs  
(
);
